Show / Hide Table of Contents
Class LineSegment3D
Represents a line segment in three-dimensional space.
Inheritance
System.Object
OpenObject
OpenElementId
Segment3D
LineSegment3D
Inherited Members
 Segment3D.StartPoint
 Segment3D.EndPoint
 Segment3D.LocalCoordinateSystem
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Geometry3D
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.Geometry3D.LineSegment3D,CI.Geometry3D", "CI.Geometry3D.ILineSegment3D,CI.BasicTypes")]
public class LineSegment3D : Segment3D
 Improve this Doc
 View Source